---
kind: type
id: T:Autodesk.Revit.DB.Mechanical.Zone
source: html/b47e1280-b436-5f9d-17dc-5b315b50c5ee.htm
---
# Autodesk.Revit.DB.Mechanical.Zone

A zone is a collection of one or more spaces.

## Syntax (C#)
```csharp
public class Zone : Element
```

## Remarks
The concept of zones is central to the way in which engineers
 design HVAC systems. When you are designing HVAC systems, you
 relate to zones as spaces that are under the same thermostatic
 control. Conceptually, zones are an arbitrary set of areas or
 volumes within a building that is controlled by one thermostat.
 An area based load is a collection of one or more electrical
 load areas. When it has the AreaBasedLoadData, it is an area
 based load, otherwise, it is a zone.